#### FamilySizeTableColumn Members

---

|  |
| --- |
| FamilySizeTableColumn Class   Methods   Properties   See Also |

The  FamilySizeTableColumn  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  FamilySizeTableColumn |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSpecTypeId | Gets the identifier of the spec describing values in the column. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetUnitTypeId | Gets the identifier of the unit quantifying values in the column. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Name | The column name. |

# See Also

FamilySizeTableColumn Class

Autodesk.Revit.DB Namespace